app/Controllers/Kendaraan.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Kendaraan',
            'kendaraan' => $this->kendaraanModel->findAll()
---
SELECT *
FROM `kendaraan`