app/Controllers/Pemesanan.php

SELECT *
FROM `pemesanan`
WHERE `status` = 'belum bayar'
AND `created_at` <= '2025-08-25 06:34:45'
DELETE FROM `detailpemesanan`
WHERE `pemesananid` = '92'
DELETE FROM `pemesanan`
WHERE `idpemesanan` IN ('92')
---
   public function index()
{
    // 🔍 Cari pesanan yang sudah lewat 3 menit dan belum dibayar
    $expiredOrders = $this->modelPemesanan
        ->where('status', 'belum bayar')
        ->where('created_at <=', date('Y-m-d H:i:s', strtotime('-3 minutes')))
        ->findAll();

    if (!empty($expiredOrders)) {
        $this->modelPemesanan->transStart();

        try {
            foreach ($expiredOrders as $order) {
                $id = $order['idpemesanan'];

                // Ambil nama file bukti pembayaran
                $buktiFileName = $order['bukti_pembayaran'];

                // Hapus detail pemesanan
                $this->modelDetailPemesanan->where('pemesananid', $id)->delete();

                // Hapus data pemesanan
                $this->modelPemesanan->delete($id);

SELECT *
FROM `user`
WHERE `status` = 'penumpang'
SELECT *
FROM `kendaraan`
---
   public function create()
{
    $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');

    $data = [
        'title' => 'Tambah Pemesanan',
        'users' => $this->modelUser->where('status', 'penumpang')->findAll(),
        'rutes' => $this->modelRute->getRutesWithAvailableSeats($tanggal),
        'kendaraans' => $this->modelKendaraan->findAll(),

SELECT `kursikendaraan`.`nomorkursi`, `kendaraan`.`namakendaraan` as `nama_kendaraan`
FROM `pemesanan`
JOIN `detailpemesanan` ON `pemesanan`.`idpemesanan` = `detailpemesanan`.`pemesananid`
JOIN `kursikendaraan` ON `detailpemesanan`.`kursikendaraanid` = `kursikendaraan`.`idkursi`
JOIN `kendaraan` ON `kursikendaraan`.`idkendaraan` = `kendaraan`.`idkendaraan`
WHERE `pemesanan`.`tanggal` = '2025-08-25'
AND `pemesanan`.`idrute` = '11'
AND `detailpemesanan`.`kursikendaraanid` = '10'
 LIMIT 1
---
    foreach ($penumpangData as $penumpang) {
        $kursiId = $penumpang['kursikendaraanid'] ?? null;
        if ($kursiId) {
            $isBooked = $this->modelPemesanan
                ->join('detailpemesanan', 'pemesanan.idpemesanan = detailpemesanan.pemesananid')
                ->join('kursikendaraan', 'detailpemesanan.kursikendaraanid = kursikendaraan.idkursi')
                ->join('kendaraan', 'kursikendaraan.idkendaraan = kendaraan.idkendaraan')
                ->where('pemesanan.tanggal', $tanggal)
                ->where('pemesanan.idrute', $idrute)
                ->where('detailpemesanan.kursikendaraanid', $kursiId)
                ->select('kursikendaraan.nomorkursi, kendaraan.namakendaraan as nama_kendaraan')
                ->first();

SELECT *
FROM `rute`
WHERE `rute`.`idrute` = '11'
---

    try {
        // Ambil data rute
        $ruteInfo      = $this->modelRute->find($idrute);

SELECT *
FROM `jadwalberangkat`
WHERE `idrute` = '11'
AND `tanggal` = '2025-08-25'
AND `idkendaraan` = '3'
 LIMIT 1
---
        };

        // Cek apakah jadwal sudah ada
        $jadwalExist = $this->modelJadwalBerangkat
            ->where('idrute', $idrute)
            ->where('tanggal', $tanggal)
            ->where('idkendaraan', $idkendaraan)
            ->first();

SELECT `iduser`
FROM `jadwalberangkat`
ORDER BY `idjadwal` DESC
 LIMIT 1
---
            }

            // Cek supir terakhir
            $lastSupir   = $this->modelJadwalBerangkat->select('iduser')->orderBy('idjadwal', 'DESC')->first();

INSERT INTO `jadwalberangkat` (`iduser`, `idkendaraan`, `idrute`, `tanggal`, `jam`) VALUES ('8', '3', '11', '2025-08-25', '19:00')
---
                    'jam'        => $jam
                ];

                $this->modelJadwalBerangkat->insert($jadwalData);

INSERT INTO `pemesanan` (`id_user`, `idrute`, `tanggal`, `jumlah_orang`, `total`, `status`, `bukti_pembayaran`, `idjadwal`, `created_at`, `updated_at`) VALUES ('4', '11', '2025-08-25', '1', '80000', 'belum bayar', NULL, 66, '2025-08-25 06:35:45', '2025-08-25 06:35:45')
INSERT INTO `detailpemesanan` (`pemesananid`, `kursikendaraanid`, `namapenumpang`, `jeniskelamin`) VALUES (93, '10', 'El Islami Fitri', 'Perempuan')
---
            'idjadwal'         => $idjadwal,
        ];

        $this->modelPemesanan->insert($pemesananData);
        $pemesananId = $this->modelPemesanan->insertID();

        foreach ($penumpangData as $penumpang) {
            $this->modelDetailPemesanan->insert([
                'pemesananid'     => $pemesananId,
                'kursikendaraanid'=> $penumpang['kursikendaraanid'] ?? null,
                'namapenumpang'   => $penumpang['namapenumpang'] ?? '',
                'jeniskelamin'    => $penumpang['jeniskelamin'] ?? ''
            ]);

SELECT *
FROM `rute`
WHERE `rute`.`idrute` = '2'
SELECT *
FROM `jadwalberangkat`
WHERE `idrute` = '2'
AND `tanggal` = '2025-08-10'
 LIMIT 1
---
 public function getAvailableKursi()
{
    try {
        $idrute = $this->request->getGet('idrute');
        $tanggal = $this->request->getGet('tanggal');
        $exclude = $this->request->getGet('exclude'); // opsional: idpemesanan yang sedang diedit

        if (!$idrute || !$tanggal) {
            return $this->response->setJSON(['error' => 'Parameter idrute dan tanggal diperlukan'])->setStatusCode(400);
        }

        $jadwalModel = new ModelJadwalBerangkat();
        $kursiModel = new ModelKursiKendaraan();
        $pemesananModel = new ModelPemesanan();
        $ruteModel = new ModelRute();

        $rute = $ruteModel->find($idrute);
        if (!$rute) {
            return $this->response->setJSON(['error' => 'Rute tidak ditemukan'])->setStatusCode(404);
        }

        $jadwal = $jadwalModel->where('idrute', $idrute)
                              ->where('tanggal', $tanggal)
                              ->first();

SELECT `kursikendaraan`.*, `kendaraan`.`namakendaraan` as `nama_kendaraan`
FROM `kursikendaraan`
JOIN `kendaraan` ON `kendaraan`.`idkendaraan` = `kursikendaraan`.`idkendaraan`
WHERE `kursikendaraan`.`idkendaraan` = '3'
---
            return $this->response->setJSON(array_values($availableKursi));
        } else {
            // Jika jadwal belum ada, semua kursi tersedia
            $kursi = $kursiModel->select('kursikendaraan.*, kendaraan.namakendaraan as nama_kendaraan')
                                ->join('kendaraan', 'kendaraan.idkendaraan = kursikendaraan.idkendaraan')
                                ->where('kursikendaraan.idkendaraan', $rute['idkendaraan'])
                                ->findAll();