app/Models/ModelJadwalBerangkat.php

public function getFilteredJadwal($tanggal = '')
{
    $builder = $this->select('jadwalberangkat.*, user.nama_user, user.nohp,
                            kendaraan.namakendaraan, kendaraan.nopolisi_kendaraan,
                            rute.asal, rute.tujuan, rute.harga,
                            COALESCE(penumpang.jumlah_penumpang, 0) as jumlah_penumpang')
               ->join('user', 'user.id_user = jadwalberangkat.iduser')
               ->join('kendaraan', 'kendaraan.idkendaraan = jadwalberangkat.idkendaraan')
               ->join('rute', 'rute.idrute = jadwalberangkat.idrute')
               ->join('(SELECT idjadwal, COUNT(detailpemesananid) as jumlah_penumpang
                        FROM pemesanan p
                        JOIN detailpemesanan dp ON p.idpemesanan = dp.pemesananid
                        GROUP BY idjadwal) penumpang',
                      'penumpang.idjadwal = jadwalberangkat.idjadwal', 'left')
               ->where('user.status', 'supir');

    if (!empty($tanggal)) {
        $builder->where('jadwalberangkat.tanggal', $tanggal);
    }

    return $builder->orderBy('jadwalberangkat.tanggal', 'ASC')
                  ->orderBy('jadwalberangkat.jam', 'ASC')
                  ->findAll();
---
SELECT `jadwalberangkat`.*, `user`.`nama_user`, `user`.`nohp`, `kendaraan`.`namakendaraan`, `kendaraan`.`nopolisi_kendaraan`, `rute`.`asal`, `rute`.`tujuan`, `rute`.`harga`, COALESCE(penumpang.jumlah_penumpang, 0) as jumlah_penumpang
FROM `jadwalberangkat`
JOIN `user` ON `user`.`id_user` = `jadwalberangkat`.`iduser`
JOIN `kendaraan` ON `kendaraan`.`idkendaraan` = `jadwalberangkat`.`idkendaraan`
JOIN `rute` ON `rute`.`idrute` = `jadwalberangkat`.`idrute`
LEFT JOIN (SELECT idjadwal, COUNT(detailpemesananid) as jumlah_penumpang 
                        FROM pemesanan p 
                        JOIN detailpemesanan dp ON p.idpemesanan = dp.pemesananid 
                        GROUP BY idjadwal) penumpang ON `penumpang`.`idjadwal` = `jadwalberangkat`.`idjadwal`
WHERE `user`.`status` = 'supir'
AND `jadwalberangkat`.`tanggal` = '2025-08-25'
ORDER BY `jadwalberangkat`.`tanggal` ASC, `jadwalberangkat`.`jam` ASC