app/Models/ModelRute.php

SELECT `rute`.*, `kendaraan`.`namakendaraan`, `kendaraan`.`nopolisi_kendaraan`, `kendaraan`.`jumlahkursi`
FROM `rute`
JOIN `kendaraan` ON `kendaraan`.`idkendaraan` = `rute`.`idkendaraan`
---
    public function getWithKendaraan()
    {
        return $this->select('rute.*, kendaraan.namakendaraan, kendaraan.nopolisi_kendaraan, kendaraan.jumlahkursi')
                   ->join('kendaraan', 'kendaraan.idkendaraan = rute.idkendaraan')
                   ->findAll();

SELECT `rute`.*, `kendaraan`.`namakendaraan`, `kendaraan`.`nopolisi_kendaraan`, `kendaraan`.`jumlahkursi`
FROM `rute`
JOIN `kendaraan` ON `kendaraan`.`idkendaraan` = `rute`.`idkendaraan`
SELECT COUNT(*) AS `numrows`
FROM `kursikendaraan`
WHERE `idkendaraan` = '2'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
JOIN `detailpemesanan` ON `detailpemesanan`.`pemesananid` = `pemesanan`.`idpemesanan`
WHERE `pemesanan`.`idrute` = '4'
AND `pemesanan`.`tanggal` = '2025-08-09'
---
  public function getRutesWithAvailableSeats($tanggal)
{
    $routes = $this->select('rute.*, kendaraan.namakendaraan, kendaraan.nopolisi_kendaraan, kendaraan.jumlahkursi')
                   ->join('kendaraan', 'kendaraan.idkendaraan = rute.idkendaraan')
                   ->findAll();

    $result = [];

    foreach ($routes as $route) {
        // Ambil semua kursi kendaraan untuk rute ini
        $totalSeats = $this->db->table('kursikendaraan')
            ->where('idkendaraan', $route['idkendaraan'])
            ->countAllResults();

        // Hitung kursi yang sudah dipesan
        $bookedSeats = $this->db->table('pemesanan')
            ->select('detailpemesanan.kursikendaraanid')
            ->join('detailpemesanan', 'detailpemesanan.pemesananid = pemesanan.idpemesanan')
            ->where('pemesanan.idrute', $route['idrute'])
            ->where('pemesanan.tanggal', $tanggal)
            ->countAllResults();