app/Models/ModelPemesanan.php

SELECT `pemesanan`.*, `user`.`nama_user`, `rute`.`asal`, `rute`.`tujuan`, `rute`.`harga`, `kendaraan`.`namakendaraan`, `kendaraan`.`nopolisi_kendaraan`, `jadwalberangkat`.`jam` as `jam_berangkat`
FROM `pemesanan`
JOIN `user` ON `user`.`id_user` = `pemesanan`.`id_user`
JOIN `rute` ON `rute`.`idrute` = `pemesanan`.`idrute`
LEFT JOIN `kendaraan` ON `kendaraan`.`idkendaraan` = `rute`.`idkendaraan`
LEFT JOIN `jadwalberangkat` ON `jadwalberangkat`.`idjadwal` = `pemesanan`.`idjadwal`
WHERE `pemesanan`.`id_user` = '6'
ORDER BY `pemesanan`.`tanggal` DESC
---
    public function getPemesananWithDetails($userId = null)
    {
        $builder = $this->select('pemesanan.*, user.nama_user, rute.asal, rute.tujuan, rute.harga,
                                kendaraan.namakendaraan, kendaraan.nopolisi_kendaraan,
                                jadwalberangkat.jam as jam_berangkat')
                        ->join('user', 'user.id_user = pemesanan.id_user')
                        ->join('rute', 'rute.idrute = pemesanan.idrute')
                        ->join('kendaraan', 'kendaraan.idkendaraan = rute.idkendaraan', 'left')
                        ->join('jadwalberangkat', 'jadwalberangkat.idjadwal = pemesanan.idjadwal', 'left');

        if ($userId !== null) {
            $builder->where('pemesanan.id_user', $userId);
        }

        return $builder->orderBy('pemesanan.tanggal', 'DESC')
                      ->findAll();